Repository: TTLC198/HSMonitor
Catalog: HSMonitor/Properties/Resources.*.resx
Languages: ru

# AboutButtonContent
source: About
ru: О проекте

# AboutButtonTooltip
source: Open project page on GitHub
ru: Открыть страницу проекта на GitHub

# AdminPrivilegesRequirementMessageText
source: Please run application as an administrator so that the library can get complete information about the current state of the computer hardware. Press OK to restart the application as administrator.
ru: Пожалуйста, запустите приложение от имени администратора для того, чтобы программа могла получить полную информацию о текущем состоянии ПК. Нажмите ОК для перезапуска программы от имени администратора.

# AdminPrivilegesRequirementMessageTitle
source: Less information about PC
ru: Недостаточно прав

# AutoDetectHardwareSwitchText
source: Autodetect Hardware:
ru: Автоопределение:

# AutoDetectHardwareTooltip
source: On/Off autodetect hardware
ru: Автоопределение комплектующих

# AutoStartupSwitchText
source: Start with Windows
ru: Автозагрузка

# AutoStartupTooltip
source: Launch HSMonitor at Windows startup
ru: Запуск HSMonitor при запуске Windows

# AutoUpdateSwitchText
source: Enable auto update
ru: Автообновление

# AutoUpdateTooltip
source: On/Off auto update
ru: Автообновление приложения с сервера

# BackwardCompabilityText
source: Backward compability
ru: Обратная совместимость

# BackwardCompabilityTooltip
source: Enable backward compatibility for devices with software version 1.1.4 and below
ru: Включить обратную совместимость для устройств с версией ПО 1.1.4 и ниже

# BaudRateText
source: Baud Rate:
ru: Скорость порта:

# CancelButtonTooltip
source: Cancel
ru: Отмена

# CheckForUpdatesTooltip
source: Check for updates
ru: Проверить обновления

# CloseAppFromTrayButtonText
source: Close
ru: Закрыть

# CloseButtonTooltip
source: Close HSMonitor
ru: Закрыть HSMonitor

# ConfigurationFileErrorMessageText
source: Application configuration file was not found in the program folder or was modified manually. Please reinstall the program to fix the problem.
ru: Не найден файл конфигурации программы или он был изменен вручную. Пожалуйста, переустановите программу, чтобы решить проблему.

# CustomCPUIconText
source: CPU icon:
ru: Иконка CPU:

# CustomCPUNameText
source: Custom CPU name:
ru: Кастомное имя CPU:

# CustomGPUIconText
source: GPU icon:
ru: Иконка GPU:

# CustomGPUNameText
source: Custom GPU name:
ru: Кастомное имя GPU:

# CustomRAMIconText
source: RAM icon:
ru: Иконка RAM:

# DefaultCPUFreqText
source: Default CPU Frequency(MHz):
ru: Частота CPU без разгона(МГц):

# DefaultGPUFreqText
source: Default GPU Frequency(MHz):
ru: Частота GPU без разгона(МГц):

# DisplayBrightnessText
source: Display brightness:
ru: Яркость дисплея:

# DownloadingText
source: Downloading...
ru: Скачивание...

# HiddenAutoStartupTooltip
source: Launch HSMonitor hidden at Windows startup
ru: Запуск HSMonitor в свернутом режиме при запуске Windows

# HiddenStartSwitchText
source: Start hidden
ru: Запуск скрыто

# HideButtonTooltip
source: Hide HSMonitor
ru: Скрыть HSMonitor

# MessageBoxCancelButtonText
source: Cancel
ru: Отмена

# MessageBoxErrorText
source: An error has occurred, the error text is shown below:
ru: Произошла следующая ошибка:

# MessageBoxErrorTitle
source: Some error has occurred
ru: Произошла ошибка

# MessageBoxOkButtonText
source: OK
ru: ОК

# MessageBoxRestartButtonText
source: Restart
ru: Перезапуск

# NewUpdateMessageCurrentVersionText
source: You are using version
ru: Сейчас установлена версия

# NewUpdateMessageTitle
source: New update available!
ru: Обновление!

# NewUpdateMessageUpdateText
source: Do you want to update the application now?
ru: Вы хотите установить обновление сейчас?

# NewUpdateMessageVersionText
source: There is new version available:
ru: Доступна новая версия:

# NoConnectionBusyMessageText
source: is busy!
ru: занят!

# NoConnectionErrorMessageText
source: Please connect a device or choose a different port.
ru: Пожалуйста, подключите устройство в другой порт.

# NoConnectionText
source: No connection!
ru: Нет доступа!

# OpenSettingsTooltip
source: Open settings
ru: Открыть настройки

# ProjectURLText
source: Project URL on GitHub:
ru: Проект на GitHub:

# RefreshPortsButtonTooltip
source: Refresh all available ports
ru: Обновить все доступные порты

# ResetButtonTooltip
source: Reset all settings to their defaults
ru: Сброс всех настроек к стандартным

# RestartRequirementMessageText
source: You need to restart the program to change the language.
ru: Для изменения языка необходимо перезапустить программу.

# RestartRequirementMessageTitle
source: Restart required
ru: Необходим перезапуск

# RunAsAdminSwitchText
source: Run as administrator
ru: Запуск от админа

# RunAsAdminTooltip
source: Launch HSMonitor as administrator directly
ru: При запуске приложения будут напрямую запрашиваться права администратора

# SaveButtonTooltip
source: Save settings
ru: Сохранить настройки

# SelectCPUText
source: Select CPU:
ru: Выбор CPU:

# SelectGPUText
source: Select GPU:
ru: Выбор GPU:

# SelectLanguageText
source: Select language:
ru: Выбор языка:

# SerialPortText
source: Serial port:
ru: Выбор порта:

# SettingsButtonContent
source: Settings
ru: Настройки

# ShowWindowFromTrayButtonText
source: Show
ru: Открыть

# TXIntervalText
source: TX Interval(ms):
ru: Интервал отправки(мс):

# UpdateAvailableText
source: Update available!
ru: Доступно обновление!

# UpdateCompletedText
source: A new update has been downloaded, you need to restart the program to install it.
ru: Новое обновление скачано, необходим перезапуск для установки.

# UpdateCompletedTitle
source: Restart needed
ru: Необходим перезапуск

# UpdateDownloadProgressTooltip
source: Update Download Progress
ru: Прогресс загрузки обновления

# UpToDateText
source: You're up to date
ru: Нет обновлений
